
# State **`s3://infrahouse-github-control-state/terraform.tfstate`**
## Affected resources counts

|   Success |   🟢 Add |   🟡 Change |    Destroy |
|----------:|---------:|------------:|-----------:|
|        ✅ |        8 |           2 |          0 |
## Affected resources by action

|  Action  | Resources                                                                                |
|:--------:|:-----------------------------------------------------------------------------------------|
|    🟢    | `module.repos["terraform-aws-s3-bucket"].github_branch_default.main`                     |
|    🟢    | `module.repos["terraform-aws-s3-bucket"].github_branch_protection.main[0]`               |
|    🟢    | `module.repos["terraform-aws-s3-bucket"].github_repository.repo`                         |
|    🟢    | `module.repos["terraform-aws-s3-bucket"].github_repository_file.renovate-json[0]`        |
|    🟢    | `module.repos["terraform-aws-s3-bucket"].github_repository_file.vuln_scanner_workflow`   |
|    🟢    | `module.repos["terraform-aws-s3-bucket"].github_repository_ruleset.main[0]`              |
|    🟢    | `module.repos["terraform-aws-s3-bucket"].github_team_repository.admin`                   |
|    🟢    | `module.repos["terraform-aws-s3-bucket"].github_team_repository.dev`                     |
|    🟡    | `module.infrahouse8-github-control.module.state-bucket.aws_s3_bucket.state-bucket`       |
|    🟡    | `module.infrahouse8-github-control.module.state-bucket.aws_s3_bucket_policy.state-bucke` |
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.repos["terraform-aws-s3-bucket"].github_branch_default.main will be created
  + resource "github_branch_default" "main" {
      + branch     = "main"
      + etag       = (known after apply)
      + id         = (known after apply)
      + rename     = false
      + repository = "terraform-aws-s3-bucket"
    }

  # module.repos["terraform-aws-s3-bucket"].github_branch_protection.main[0] will be created
  + resource "github_branch_protection" "main" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + pull_request_bypassers          = [
              + "A_kwHOB0VVB84AD4Ir",
            ]
          + require_code_owner_reviews      = true
          + require_last_push_approval      = false
          + required_approving_review_count = 1
        }
    }

  # module.repos["terraform-aws-s3-bucket"].github_repository.repo will be created
  + resource "github_repository" "repo" {
      + allow_auto_merge            = true
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "Terraform module for an ISO27001 compliant S3 bucket."
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = true
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "terraform-aws-s3-bucket"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = (known after apply)
      + visibility                  = "public"
      + vulnerability_alerts        = true
      + web_commit_signoff_required = false

      + security_and_analysis (known after apply)
    }

  # module.repos["terraform-aws-s3-bucket"].github_repository_file.renovate-json[0] will be created
  + resource "github_repository_file" "renovate-json" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Configure renovate"
      + commit_sha                   = (known after apply)
      + content                      = jsonencode(
            {
              + "$schema"         = "https://docs.renovatebot.com/renovate-schema.json"
              + extends           = [
                  + "config:recommended",
                ]
              + prConcurrentLimit = 1
            }
        )
      + file                         = "renovate.json"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "terraform-aws-s3-bucket"
      + sha                          = (known after apply)
    }

  # module.repos["terraform-aws-s3-bucket"].github_repository_file.vuln_scanner_workflow will be created
  + resource "github_repository_file" "vuln_scanner_workflow" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Update vuln-scanner-pr.yml workflow"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            ---
            name: OSV-Scanner PR Scan
            
            on:  # yamllint disable-line rule:truthy
              pull_request:
                branches: [main]
            
            permissions:
              # Required to upload SARIF file to CodeQL. See: https://github.com/github/codeql-action/issues/2117
              actions: read
              # Require writing security events to upload SARIF file to security tab
              security-events: write
              # Only need to read contents
              contents: read
            
            jobs:
              vulnerability-check:
                uses: "google/osv-scanner-action/.github/workflows/osv-scanner-reusable.yml@v2.2.2"
                with:
                  scan-args: --config osv-scanner.toml
                  upload-sarif: false
        EOT
      + file                         = "./.github/workflows/vuln-scanner-pr.yml"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "terraform-aws-s3-bucket"
      + sha                          = (known after apply)
    }

  # module.repos["terraform-aws-s3-bucket"].github_repository_ruleset.main[0] will be created
  + resource "github_repository_ruleset" "main" {
      + enforcement = "active"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "Main Branch Protection"
      + node_id     = (known after apply)
      + repository  = "terraform-aws-s3-bucket"
      + ruleset_id  = (known after apply)
      + target      = "branch"

      + bypass_actors {
          + actor_id    = 1016363
          + actor_type  = "Integration"
          + bypass_mode = "always"
        }
      + bypass_actors {
          + actor_id    = 14268696
          + actor_type  = "Team"
          + bypass_mode = "always"
        }

      + conditions {
          + ref_name {
              + exclude = []
              + include = [
                  + "~DEFAULT_BRANCH",
                ]
            }
        }

      + rules {
          + update_allows_fetch_and_merge = false

          + pull_request {
              + dismiss_stale_reviews_on_push     = true
              + require_code_owner_review         = true
              + require_last_push_approval        = false
              + required_approving_review_count   = 1
              + required_review_thread_resolution = false
            }

          + required_status_checks {
              + do_not_enforce_on_create             = false
              + strict_required_status_checks_policy = true

              + required_check {
                  + context        = "vulnerability-check / osv-scan"
                  + integration_id = 0
                }
            }
        }
    }

  # module.repos["terraform-aws-s3-bucket"].github_team_repository.admin will be created
  + resource "github_team_repository" "admin" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "terraform-aws-s3-bucket"
      + team_id    = "14268696"
    }

  # module.repos["terraform-aws-s3-bucket"].github_team_repository.dev will be created
  + resource "github_team_repository" "dev" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "terraform-aws-s3-bucket"
      + team_id    = "7332815"
    }

  # module.infrahouse8-github-control.module.state-bucket.data.aws_iam_policy_document.enforce_ssl_policy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "enforce_ssl_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:*",
            ]
          + effect    = "Deny"
          + resources = [
              + "arn:aws:s3:::infrahouse-github-control-state",
              + "arn:aws:s3:::infrahouse-github-control-state/*",
            ]
          + sid       = "AllowSSLRequestsOnly"

          + condition {
              + test     = "Bool"
              + values   = [
                  + "false",
                ]
              + variable = "aws:SecureTransport"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "*"
            }
        }
    }

  # module.infrahouse8-github-control.module.state-bucket.aws_s3_bucket.state-bucket will be updated in-place
  ~ resource "aws_s3_bucket" "state-bucket" {
        id                          = "infrahouse-github-control-state"
      ~ tags                        = {
            "created_by_module" = "infrahouse/state-bucket/aws"
            "lock_table"        = "infrahouse-github-control-state-polished-lioness"
          ~ "module_version"    = "2.1.3" -> "2.2.0"
            "used_by"           = "infrahouse8/github-control"
        }
      ~ tags_all                    = {
          ~ "module_version"    = "2.1.3" -> "2.2.0"
            # (4 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.infrahouse8-github-control.module.state-bucket.aws_s3_bucket_policy.state-bucke will be updated in-place
  ~ resource "aws_s3_bucket_policy" "state-bucke" {
        id     = "infrahouse-github-control-state"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:*"
                      - Condition = {
                          - Bool = {
                              - "aws:SecureTransport" = "false"
                            }
                        }
                      - Effect    = "Deny"
                      - Principal = "*"
                      - Resource  = [
                          - "arn:aws:s3:::infrahouse-github-control-state/*",
                          - "arn:aws:s3:::infrahouse-github-control-state",
                        ]
                      - Sid       = "AllowSSLRequestsOnly"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 8 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
Releasing state lock. This may take a few moments...
```
</details>
<details><summary><i>metadata</i></summary>

```
eyJzMzovL2luZnJhaG91c2UtZ2l0aHViLWNvbnRyb2wtc3RhdGUvdGVycmFmb3JtLnRmc3RhdGUiOiB7InN1Y2Nlc3MiOiB0cnVlLCAiYWRkIjogOCwgImNoYW5nZSI6IDIsICJkZXN0cm95IjogMH19
```
</details>